/* Initial login prompt for username and password */
"Login {0} with username and password" = "ล็อกอินด้วยชื่อผู้ใช้และรหัสผ่าน";

/* Lookup of password in Keychain */
"No login credentials could be found in the Keychain" = "ไม่พบหนังสือรับรองการล็อกอินใน Keychain";
"The use of the Keychain is disabled in the Preferences" = "การใช้งาน Keychain ถูกปิดการใช้งาน";

/* Password proctected private key for SSH public key authentication */
"Invalid passphrase" = "Invalid passphrase";
"Private key password protected" = "รหัสผ่านกุญแจส่วนตัวถูกป้องกัน";
"Enter the passphrase for the private key file" = "ใส่วลีรหัสผ่านสำหรับไฟล์กุญแจส่วนตัว";

"Login canceled" = "การล็อกอินถูกยกเลิก";
"Login failed" = "การล็อกอินล้มเหลว";
"Login successful" = "การล็อกอินสำเร็จ";

/* Private key selection for SSH public key authentication */
"Select the private key in PEM or PuTTY format" = "Select the private key in PEM or PuTTY format";

/* Challenge-Respone authentication */
"Partial authentication success" = "Partial authentication success";
"Provide additional login credentials" = "Provide additional login credentials";

/* Login prompt placeholders */
"Username" = "ชื่อผู้ใช้";
"Password" = "รหัสผ่าน";

/* Warning when credentials are sent using unsecured protocol. Unsecure FTP connection */
"Unsecured {0} connection" = "Unsecured {0} connection";

/* Credentials sent over plaintext connection */
"{0} will be sent in plaintext." = "{0} will be sent in plaintext.";
"Don't show again" = "Don't show again";
"Continue" = "Continue";
"Disconnect" = "Disconnect";

/* Protocol switch proposal */
"The server supports encrypted connections. Do you want to switch to {0}?" = "The server supports encrypted connections. Do you want to switch to {0}?";
"Change" = "Change";
/* OAuth2 */
"Paste the authentication code from your web browser" = "Paste the authentication code from your web browser";
"Open web browser to authenticate and obtain an authorization code" = "Open web browser to authenticate and obtain an authorization code";
